import { toJapaneseDateString, sortJapanese } from "./index.ts";

describe("toJapaneseDateString", () => {
  it.each`
    input                     | output
    ${new Date("1989-01-07")} | ${"昭和64年1月7日"}
    ${new Date("1989-01-08")} | ${"平成元年1月8日"}
    ${new Date("2019-04-30")} | ${"平成31年4月30日"}
    ${new Date("2019-05-01")} | ${"令和元年5月1日"}
    ${new Date("9999-12-31")} | ${"令和7981年12月31日"}
  `("$input is $output", ({ input, output }) => {
    expect(toJapaneseDateString(input)).toBe(output);
  });
});

describe("sortJapanese", () => {
  it("濁点、半濁点、拗音を無視する", () => {
    const expected = [
      "ぁ", "あ", "ぃ", "い", "ぅ", "う", "ゔ", "ぇ", "え", "ぉ", "お",
      "か", "が", "き", "ぎ", "く", "ぐ", "け", "げ", "こ", "ご",
      "さ", "ざ", "し", "じ", "す", "ず", "せ", "ぜ", "そ", "ぞ",
      "た", "だ", "ち", "ぢ", "っ", "つ", "づ", "て", "で", "と", "ど",
      "な", "に", "ぬ", "ね", "の",
      "は", "ば", "ぱ", "ひ", "び", "ぴ", "ふ", "ぶ", "ぷ", "へ", "べ", "ぺ", "ほ", "ぼ", "ぽ",
      "ま", "み", "む", "め", "も",
      "ゃ", "や", "ゅ", "ゆ", "ょ", "よ",
      "ら", "り", "る", "れ", "ろ",
      "ゎ", "わ", "を", "ん",
    ];
    const filter = [
      (e) => e === "ぁ" || e === "あ",
      (e) => e === "ぁ" || e === "あ",
      (e) => e === "ぃ" || e === "い",
      (e) => e === "ぃ" || e === "い",
      (e) => e === "ぅ" || e === "う" || e === "ゔ",
      (e) => e === "ぅ" || e === "う" || e === "ゔ",
      (e) => e === "ぅ" || e === "う" || e === "ゔ",
      (e) => e === "ぇ" || e === "え",
      (e) => e === "ぇ" || e === "え",
      (e) => e === "ぉ" || e === "お",
      (e) => e === "ぉ" || e === "お",
      (e) => e === "か" || e === "が",
      (e) => e === "か" || e === "が",
      (e) => e === "き" || e === "ぎ",
      (e) => e === "き" || e === "ぎ",
      (e) => e === "く" || e === "ぐ",
      (e) => e === "く" || e === "ぐ",
      (e) => e === "け" || e === "げ",
      (e) => e === "け" || e === "げ",
      (e) => e === "こ" || e === "ご",
      (e) => e === "こ" || e === "ご",
      (e) => e === "さ" || e === "ざ",
      (e) => e === "さ" || e === "ざ",
      (e) => e === "し" || e === "じ",
      (e) => e === "し" || e === "じ",
      (e) => e === "す" || e === "ず",
      (e) => e === "す" || e === "ず",
      (e) => e === "せ" || e === "ぜ",
      (e) => e === "せ" || e === "ぜ",
      (e) => e === "そ" || e === "ぞ",
      (e) => e === "そ" || e === "ぞ",
      (e) => e === "た" || e === "だ",
      (e) => e === "た" || e === "だ",
      (e) => e === "ち" || e === "ぢ",
      (e) => e === "ち" || e === "ぢ",
      (e) => e === "っ" || e === "つ" || e === "づ",
      (e) => e === "っ" || e === "つ" || e === "づ",
      (e) => e === "っ" || e === "つ" || e === "づ",
      (e) => e === "て" || e === "で",
      (e) => e === "て" || e === "で",
      (e) => e === "と" || e === "ど",
      (e) => e === "と" || e === "ど",
      (e) => e === "な",
      (e) => e === "に",
      (e) => e === "ぬ",
      (e) => e === "ね",
      (e) => e === "の",
      (e) => e === "は" || e === "ば" || e === "ぱ",
      (e) => e === "は" || e === "ば" || e === "ぱ",
      (e) => e === "は" || e === "ば" || e === "ぱ",
      (e) => e === "ひ" || e === "び" || e === "ぴ",
      (e) => e === "ひ" || e === "び" || e === "ぴ",
      (e) => e === "ひ" || e === "び" || e === "ぴ",
      (e) => e === "ふ" || e === "ぶ" || e === "ぷ",
      (e) => e === "ふ" || e === "ぶ" || e === "ぷ",
      (e) => e === "ふ" || e === "ぶ" || e === "ぷ",
      (e) => e === "へ" || e === "べ" || e === "ぺ",
      (e) => e === "へ" || e === "べ" || e === "ぺ",
      (e) => e === "へ" || e === "べ" || e === "ぺ",
      (e) => e === "ほ" || e === "ぼ" || e === "ぽ",
      (e) => e === "ほ" || e === "ぼ" || e === "ぽ",
      (e) => e === "ほ" || e === "ぼ" || e === "ぽ",
      (e) => e === "ま",
      (e) => e === "み",
      (e) => e === "む",
      (e) => e === "め",
      (e) => e === "も",
      (e) => e === "ゃ" || e === "や",
      (e) => e === "ゃ" || e === "や",
      (e) => e === "ゅ" || e === "ゆ",
      (e) => e === "ゅ" || e === "ゆ",
      (e) => e === "ょ" || e === "よ",
      (e) => e === "ょ" || e === "よ",
      (e) => e === "ら",
      (e) => e === "り",
      (e) => e === "る",
      (e) => e === "れ",
      (e) => e === "ろ",
      (e) => e === "ゎ" || e === "わ",
      (e) => e === "ゎ" || e === "わ",
      (e) => e === "を",
      (e) => e === "ん",];
    sortJapanese(shuffleArray(expected)).forEach((e, i) => {
      expect(filter[i](e)).toBe(true);
    });
  });

  const shuffleArray = (array) => {
    return array.slice().sort(() => Math.random() - Math.random());
  };
});
